{"config": {"name": "model_1", "output_layers": [["dense_3", 0, 0]], "layers": [{"name": "input_1", "config": {"batch_input_shape": [null, 50], "dtype": "float32", "sparse": false, "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "input_2", "config": {"batch_input_shape": [null, 50], "dtype": "float32", "sparse": false, "name": "input_2"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "embedding_1", "config": {"name": "embedding_1", "input_dim": 86359, "trainable": false, "batch_input_shape": [null, 50], "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "input_length": 50, "dtype": "float32", "embeddings_regularizer": null, "mask_zero": true, "output_dim": 300, "activity_regularizer": null}, "class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "embedding_2", "config": {"name": "embedding_2", "input_dim": 86359, "trainable": false, "batch_input_shape": [null, 50], "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "input_length": 50, "dtype": "float32", "embeddings_regularizer": null, "mask_zero": true, "output_dim": 300, "activity_regularizer": null}, "class_name": "Embedding", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "lstm_1", "config": {"name": "lstm_1", "go_backwards": false, "activity_regularizer": null, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "dropout": 0.0, "bias_constraint": null, "return_state": false, "recurrent_regularizer": null, "unroll": false, "recurrent_constraint": null, "stateful": false, "return_sequences": true, "kernel_constraint": null, "activation": "tanh", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 300, "recurrent_dropout": 0.0, "bias_regularizer": null, "implementation": 1, "use_bias": true, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "lstm_4", "config": {"name": "lstm_4", "go_backwards": false, "activity_regularizer": null, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "dropout": 0.0, "bias_constraint": null, "return_state": false, "recurrent_regularizer": null, "unroll": false, "recurrent_constraint": null, "stateful": false, "return_sequences": true, "kernel_constraint": null, "activation": "tanh", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 300, "recurrent_dropout": 0.0, "bias_regularizer": null, "implementation": 1, "use_bias": true, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM", "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lstm_2", "config": {"name": "lstm_2", "go_backwards": false, "activity_regularizer": null, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "dropout": 0.0, "bias_constraint": null, "return_state": false, "recurrent_regularizer": null, "unroll": false, "recurrent_constraint": null, "stateful": false, "return_sequences": true, "kernel_constraint": null, "activation": "tanh", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 300, "recurrent_dropout": 0.0, "bias_regularizer": null, "implementation": 1, "use_bias": true, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM", "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}, {"name": "lstm_5", "config": {"name": "lstm_5", "go_backwards": false, "activity_regularizer": null, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "dropout": 0.0, "bias_constraint": null, "return_state": false, "recurrent_regularizer": null, "unroll": false, "recurrent_constraint": null, "stateful": false, "return_sequences": true, "kernel_constraint": null, "activation": "tanh", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 300, "recurrent_dropout": 0.0, "bias_regularizer": null, "implementation": 1, "use_bias": true, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM", "inbound_nodes": [[["lstm_4", 0, 0, {}]]]}, {"name": "lstm_3", "config": {"name": "lstm_3", "go_backwards": false, "activity_regularizer": null, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "dropout": 0.0, "bias_constraint": null, "return_state": false, "recurrent_regularizer": null, "unroll": false, "recurrent_constraint": null, "stateful": false, "return_sequences": false, "kernel_constraint": null, "activation": "tanh", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 300, "recurrent_dropout": 0.0, "bias_regularizer": null, "implementation": 1, "use_bias": true, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM", "inbound_nodes": [[["lstm_2", 0, 0, {}]]]}, {"name": "lstm_6", "config": {"name": "lstm_6", "go_backwards": false, "activity_regularizer": null, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "dropout": 0.0, "bias_constraint": null, "return_state": false, "recurrent_regularizer": null, "unroll": false, "recurrent_constraint": null, "stateful": false, "return_sequences": false, "kernel_constraint": null, "activation": "tanh", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 300, "recurrent_dropout": 0.0, "bias_regularizer": null, "implementation": 1, "use_bias": true, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM", "inbound_nodes": [[["lstm_5", 0, 0, {}]]]}, {"name": "concatenate_1", "config": {"name": "concatenate_1", "axis": -1, "trainable": true}, "class_name": "Concatenate", "inbound_nodes": [[["lstm_3", 0, 0, {}], ["lstm_6", 0, 0, {}]]]}, {"name": "dense_1", "config": {"name": "dense_1", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.0, "l1": 0.0}, "class_name": "L1L2"}, "units": 200, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "dropout_1", "config": {"rate": 0.2, "name": "dropout_1", "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "center": true, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "dense_2", "config": {"name": "dense_2", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.0, "l1": 0.0}, "class_name": "L1L2"}, "units": 200, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "dropout_2", "config": {"rate": 0.2, "name": "dropout_2", "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "batch_normalization_2", "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_2", "center": true, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "dense_3", "config": {"name": "dense_3", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "units": 2, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "softmax", "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Model"}